// ОСНОВЫ JavaScript
// Урок 010. Учимся работать с системой контроля версий Git и сервисом GitHub.

//git init - для создания локального репозитория.

//git add -A/ . / <название_файла> - чтобы добавить файл в индех.

//git commit -a -m"название коммита" - создание контрольной точки с ее описанием.
// ключ (-a) добавляет все файлы. (-m) создает сообщение коммита.

//git status - позваоляет узнать статус файлов.
//у файлов может быть три основных статуса: 
//1) еще не добавлен
//2) добавлен в индекс
//3) модифицирован

//git log - показывает некоторую информацию и последовательность созданых коммитов.

//Для соединения локального репозитория и глобального на срвере github

//git remote origin master ...
