// ОСНОВЫ JavaScript
// Урок 011. Как работать с Github с разных компьютеров. gitignire. Git Kraken.

// Ситуация - домашняя папка и папка на работе. Как перенести проект из дома на работу?
// Есть 2 способа - скачать файлы на компьютер, либо использовать команду git clone

//git clone <ссылка> <название папки куда копировать>

// когда мы таким способом клонируем репозиторий, то он автоматически соединен с нашим
// онлайн репозиторием.

//команда git pull позволяет синхронизировать данные между репозиториями.
// эту команду нужно часто прописывать, если работаешь в команде, т.к. есть вероятность,
// что кто-то уже внес изменения в ветку.

//***********************/

//git ignore

//