// ОСНОВЫ JavaScript
// Урок 034. Замыкание и лексическое окружение.

// Лексическое окружение - это обьект. Делится на две части.
// 1) Внутреннее лексическое окружение - обьект, в котором свойства - это локальные
// переменные какой-либо функции.
// 2) Внешнее лексическое окружение.

// *** Замыкание - функция, которая запоминает свои внешние переменные и может получить к ним доступ. ***

// каждая функция, при ее вызове использует свое глобальное и локальное лексическое окружение.
// после отработки функции ее локальное лексическое окружение уничтожается.


